design_model/src/main/resources/行为型模式/策略模式/策略模式.md
```mermaid
classDiagram
    class Strategy {
        <<Abstract>>
        +algorithm()*
    }
    class ConcreteStrategyA {
        +algorithm()
    }
    class ConcreteStrategyB {
        +algorithm();
    }
    class Context {
        -Strategy stragety;
        +algorithm();
    }
    ConcreteStrategyA --|> Strategy
    ConcreteStrategyB --|> Strategy
    Context o-- Strategy : strategy
```
